{
  "author": "Michael Mutote gmbh",
  "name": "Chatbot",
  "version": "1.0.5.2",
  "help": [
    "How can I help you today",
    "What would you like to know"
  ],
  "yes_or_no": [
    " Let us start from the beginning, do you want me to show you how to set up the board? ",
    " How about the pieces now, do you want to learn about how the pieces move? ",
    " Did you know some pieces have special abilities? I can tell you all about them? ",
    " Would you like some hints regarding the pieces? ",
    " would you like to know some random opening and its names? ",
    " Chess etiquette is a set of unwritten rules that govern the behavior of chess players, would you like to know some?",
    " since you breezed through that tutorial, I have some questions for you. Plenty of questions. Can I test your knowledge?"
  ],
  "enquire": [
    "what would you like to learn next? ",
    "What can I show you? ",
    "ask me anything, anything at all, ",
    "I possess wisdom of the ancients. I want to share. Ask. ",
    "Ask an you shall be wiser, Ask.",
    "You have much to learn, my young padawan. Ask",
    "I cannot tell a lie, test me. ",
    "Anything else"
  ],
  "excitement": [
    "yay",
    "that is very cool",
    "I think i taught you that",
    "Did I show you that?",
    "Look at big brain over here",
    "that is impressive",
    "well done",
    "you're a natural",
    "Now I'm getting jealous",
    "how did you know"
  ],
  "incorrect_sad": [
    " No, that is not it ",
    " I don't think that is correct ",
    " No, that is not possible ",
    " WTF? "
  ],
  "encourage": [
    " Don't worry, you'll get it soon",
    " It's only a mistake",
    " you'll be fine don't worry",
    " We all make mistakes, even me",
    " Ooooo, so close, but NO!",
    " No, that is not it ",
    " I don't think that is correct ",
    " No, that is not possible ",
    " WTF? "
  ],
  "change_subject": [
    "Would you like to try something else instead?",
    "I think we should move on",
    "anyway",
    "swiftly moving on",
    "Will you be needing any more help",
    "Let's pretend none of that happened"
  ],
  "probe": [
    "Why so quite all of a sudden?",
    "Did I upset you?",
    "Do you want to continue?",
    "Do you want to take a break?",
    "Gone fishing?",
    "*chirp *chirp",
    "I was once a physics professor",
    "Earth to \"Grand-Master\" can you hear me?",
    "Where have you gone",
    "Say something. ANYTHING",
    "What's up butter-cup",
    "It's me isn't it, it's all my fault",
    "Suprpised pikachu face",
    "Please take your time",
    "M U L T I P A S S?"
  ],
  "positive_answer": [
    "Yes of course, ",
    "I think I can help with that, ",
    "Let's see, ",
    "Oh, I know this one, ",
    "I have the answer somewhere here, ",
    "Let me see if I can find out",
    "I got you",
    "T A D A A A !",
    "I do have are a very particular set of skills, to get you that answer: ",
    "mmmmh, ",
    "ummmm, "
  ],
  "no_answer": [
    "I have no clue",
    "I don't know",
    "If I had more time to look i would have the answer",
    "I never understood that part to be honest",
    "I wish I knew",
    "I would like to get back to you on that",
    "lol",
    "To be honest, I do not know",
    "My mom and dad never taught me that",
    "there might be a an answer I am not aware of"
  ],
  "intros": [
    "hello, I will be helping you learn chess. My name is AGIM. And your is? ",
    "I hope you have a chessboard because I believe in practical learning",
    "I can record games for you, but I am strict when it comes to notation. Start with the colour of piece, then the name of the piece as we discussed then the square it is in and lastly where it is going",
    "to start recording a game, just let me know",
    "I have a couple of recorded games and I can pass each move back to you, just have to prompt me for the next move"
  ],
  "agim": [
    "yo",
    "wassup",
    "how can I help",
    "I'm here",
    "talk to me",
    "all ears, or eyes",
    "HEEEEY",
    "Aha",
    "ask me a question",
    "Yes my young padawan",
    "what's shakin' bacon'",
    "I should have been a drummer"
  ],
  "repetition": [
    "Didn't I answer that already?",
    "I don't like repeating myself, lets move on",
    "I know we spoke about this",
    "You maybe want to check your previous texts?",
    "Is there something you didn't understand from before?",
    "I can help you with something else"
  ],
  "not_understanding": [
    "I'm afraid I do not understand",
    "what do you mean by that",
    "I don't know what you mean",
    "could you rephrase please",
    "I'm not sure I understand what you mean.",
    "Would you please rephrase that? I want to make sure I understand you correctly.",
    "I'm completely lost",
    "Come again",
    "I dont think I got that",
    "I don't get it",
    "huh"
  ],
  "more": [
    " shall I continue? ",
    " do you require more information? ",
    " shall I keep going? ",
    " there is more, do you want it ",
    " want more? ",
    " shall I proceed? ",
    " there is more yes?",
    " continue?",
    " press on?",
    " keep going?"
  ],
  "etiquette": [
    " Shaking hands with your opponent before and after each game",
    " Keeping silent and focused during the game, avoiding talking or making noise that can distract you or your opponent.",
    " Following the touch-move rule, which means that if you touch a piece, you have to move it, unless you announce 'ADJUST' before adjusting a piece on its square.",
    " Making clear and precise moves, placing the pieces firmly on the center of the squares and capturing pieces by removing them from the board.",
    " Pressing the clock with the same hand that you use to move the pieces, and not abusing the clock by hitting it too hard or too often.",
    " Announcing “check” and “checkmate” only if it is required by the tournament rules, otherwise it is unnecessary and can be seen as rude or distracting.",
    " Offering and accepting a draw in a polite and respectful manner, only when it is your turn to move, and not repeating the offer too often or in a hopeless position.",
    " Resigning when you are clearly losing and have no chance of saving the game, by shaking hands with your opponent or stopping the clock and congratulating them.",
    " Showing good sportsmanship by not gloating over your victory or complaining about your loss, and by analyzing the game with your opponent in a constructive and friendly way."
  ],
  "expert mode": [
    "How does a pawn move? Can it move backwards?",
    "What is so special about a knight's movement? Can it jump over other pieces? How does it move?",
    "How does a bishop move? How many squares, Can bishops change square colour?",
    "How does a rook move? How many squares? In what direction? Can it move diagonally?",
    "How does a queen move? Can a queen move like a knight?",
    "How does a king move? Can a king move more than one square at a time?",
    "What is castling? Can you castle if your king is in check? Can you castle if the rook has already moved?",
    "What is en passant?",
    "What is promotion in chess? When can you promote a pawn in chess? What piece can you promote a pawn to in chess? Can you promote a pawn to another king in chess?",
    "What is stalemate in chess? Can you put your own king in check in chess?",
    "What is the difference between check and checkmate in chess?",
    "What happens if there are no legal moves for the player whose turn it is to move?",
    "Can you win a game of chess by capturing all of your opponent’s pieces except for their king?",
    "Can you put your opponent’s king in checkmate with only one piece?",
    "Can you put your opponent’s king in stalemate with only one piece?",
    "Can you putyour opponent’s king in checkmate with only pawns?",
    "Can you put your opponent’s king in stalemate with only pawns?",
    "Can you put your opponent’s king in checkmate with only knights?",
    "Can you put your opponent’s king in stalemate with only knights?",
    "Can you put your opponent’s king in checkmate with only bishops?",
    "Can you put your opponent’s king in stalemate with only bishops?",
    "Can you put your opponent’s king in checkmate with only rooks?",
    "Can you put your opponent’s king in stalemate with only rooks?",
    "Can you put your opponent’s king in checkmate with only queens?",
    "Can you put your opponent’s king in stalemate with only queens?",
    "What is the maximum number of queens one player can have on the board at once in chess?",
    "What is the maximum number of knights one player can have on the board at once in chess?",
    "What is the maximum number of bishops one player can have on the board at once in chess?",
    "What is the maximum number of rooks one player can have on the board at once in chess?",
    "What is the maximum number of kings one player can have on the board at once in chess?",
    "What is the objective of the game of chess?",
    "How many players are needed to play a game of chess?",
    "What is the standard size of a chessboard?",
    "How many squares are on a chessboard?",
    "How do you determine which player moves first in chess?",
    "Can you move more than one piece at a time in chess?",
    "Can you skip your turn in chess?",
    "What happens if a player runs out of time in a timed game of chess?",
    "What is the touch-move rule in chess?",
    "Can you take back a move in chess?",
    "What is the fifty-move rule in chess?",
    "What is the threefold repetition rule in chess?",
    "Can you offer a draw in chess? How do you accept or decline a draw offer in chess?",
    "Can you resign a game of chess? How do you indicate that you have resigned a game of chess?",
    "What is the difference between classical, rapid, and blitz chess?",
    "What is correspondence chess?",
    "Can you capture the opponent’s king in chess?",
    "When can you castle in chess?",
    "When can you perform en passant in chess?",
    "Can you capture a piece with en passant?",
    "What is check in chess?",
    "What is checkmate in chess?",
    "Can a pawn capture a piece that is directly in front of it?",
    "Can a knight move to a square of the same color it is currently on?",
    "Can a bishop move to a square that is blocked by another piece?",
    "Can a rook move to a square that is blocked by another piece?",
    "Can a queen move to a square that is blocked by another piece?",
    "Can a king move to a square that is attacked by an opponent’s piece?",
    "Can you castle with both rooks in one move?",
    "Can you castle if your king has already moved?",
    "Can you perform en passant with any pawn?",
    "Can you promote a pawn to any piece in chess?",
    "Can you promote a pawn to an opponent’s piece in chess?",
    "What happens if your king is in check and you have no legal moves to get out of check?",
    "What happens if your king is not in check but you have no legal moves to make?",
    "Can you put your opponent’s king in checkmate with any piece in chess?",
    "Can you put your opponent’s king in stalemate with any piece in chess?",
    "Can you capture an opponent’s piece that is protected by another piece in chess?",
    "Can you put your opponent’s king in check with any piece in chess?",
    "Can you put your opponent’s king in checkmate with any combination of pieces in chess?",
    "What is a chessboard"
  ],
  "expert answers": [
    "A pawn moves forward one square, but on its first move, it can move forward two squares. NO Pawns cannot move backward.",
    "A knight moves in an L-shape: two squares in one direction (forward, backward, left, or right) and then one square perpendicular to that. YES Knights can jump over other pieces.",
    "A bishop moves diagonally any number of squares. Bishops cannot change the color of the square they are on.",
    "A rook moves horizontally or vertically any number of squares. No Rooks cannot move diagonally.",
    "A queen can move any number of squares horizontally, vertically, or diagonally. No, Queens cannot move like knights.",
    "A king can move one square in any direction (horizontally, vertically, or diagonally). Kings cannot move more than one square at a time.",
    "Castling is a special move where the king moves two squares towards a rook on the player’s first rank, then that rook moves to the square over which the king crossed. You cannot castle if your king is in check, through check, or into check. You also cannot castle if the rook involved has already moved.",
    "En passant is a special pawn capture that can occur immediately after a player moves a pawn two squares forward from its starting position, and an enemy pawn could have captured it if it had only moved one square forward. The opponent captures the just-moved pawn “as it passes” through the first square.",
    "Promotion is when a pawn reaches the opposite end of the board and is replaced by a queen, rook, bishop, or knight of the same color. You can promote a pawn to any piece except another king.",
    "Stalemate is when it is a player’s turn to move, but they have no legal moves and their king is not in check. Stalemate results in a draw. You cannot put your own king in check.",
    "Check is when a player’s king is under attack by an opponent’s piece or pawn. Checkmate is when a player’s king is in check and there is no legal move that player can make to remove the threat of capture on the next move. Checkmate ends the game and the player whose king was checkmated loses.",
    "If there are no legal moves for the player whose turn it is to move and their king is not in check, then the game ends in stalemate (a draw).",
    "You can win a game of chess by capturing all of your opponent’s pieces except for their king if your opponent resigns or runs out of time (in a timed game). However, capturing all of your opponent’s pieces does not automatically win you the game - you still need to checkmate their king.",
    "You can put your opponent’s king in checkmate with only one piece if that piece is supported by other pieces or pawns such that your opponent cannot capture it or block its attack.",
    "You can put your opponent’s king in stalemate with only one piece if that piece is supported by other pieces or pawns such that your opponent cannot capture it or block its attack.",
    "You can put your opponent’s king in checkmate with only pawns if those pawns are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in stalemate with only pawns if those pawns are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in checkmate with only knights if those knights are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in stalemate with only knights if those knights are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in checkmate with only bishops if those bishops are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in stalemate with only bishops if those bishops are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in checkmate with only rooks if those rooks are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in stalemate with only rooks if those rooks are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in checkmate with only queens if those queens are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "You can put your opponent’s king in stalemate with only queens if those queens are supported by other pieces such that your opponent cannot capture them or block their attack.",
    "The maximum number of queens one player can have on the board at once in chess is 9 (the starting queen plus 8 promoted pawns).",
    "The maximum number of knights one player can have on the board at once in chess is 10 (the starting knights plus 8 promoted pawns).",
    "The maximum number of bishops one player can have on the board at once in chess is 10 (the starting bishops plus 8 promoted pawns).",
    "The maximum number of rooks one player can have on the board at once in chess is 10 (the starting rooks plus 8 promoted pawns).",
    "The maximum number of kings one player can have on the board at once in chess is 1 (you cannot promote a pawn to another king).",
    "The objective of the game of chess is to checkmate your opponent’s king.",
    "A game of chess is played by two players.",
    "The standard size of a chessboard is 8x8 squares.",
    "There are 64 squares on a chessboard.",
    "The player with the white pieces moves first in chess.",
    "You cannot move more than one piece at a time in chess.",
    "You cannot skip your turn in chess.",
    "If a player runs out of time in a timed game of chess, they lose the game.",
    "The touch-move rule in chess states that if a player touches one of their own pieces, they must move it if it has a legal move. If a player touches an opponent’s piece, they must capture it if it is legal to do so.",
    "In casual games, players may agree to allow takebacks. In tournament games, takebacks are not allowed.",
    "The fifty-move rule in chess states that if fifty moves have been made by each player without any pawn moves or captures, either player may claim a draw.",
    "The threefold repetition rule in chess states that if the same position occurs three times with the same player to move and all pieces having the same moves available, either player may claim a draw.",
    "You can offer a draw in chess by verbally offering it to your opponent or by making an offer on your scoresheet. Your opponent can accept or decline the offer verbally or by making a note on their scoresheet.",
    "You can resign a game of chess by verbally resigning to your opponent or by tipping over your king. In tournament games, you should also stop your clock and record the result on your scoresheet.",
    "Classical chess is played with longer time controls (usually over an hour per player), rapid chess is played with intermediate time controls (usually between 10 and 60 minutes per player), and blitz chess is played with short time controls (usually under 10 minutes per player).",
    "Correspondence chess is a form of long-distance chess where moves are sent between players via mail or email. Bullet chess is a form of blitz chess where each player has less than three minutes for all their moves.",
    "You cannot capture the opponent’s king in chess. When you put your opponent’s king in checkmate, you win the game without actually capturing their king.",
    "You can castle if neither your king nor the rook involved has moved yet, if there are no pieces between them, and if your king is not currently in check or would not pass through or end up in check after castling.",
    "You can perform en passant immediately after an opponent’s pawn moves two squares forward from its starting position and lands next to one of your pawns. Your pawn can then capture that pawn as if it had only moved one square forward.",
    "Yes, you can capture a piece with en passant - specifically an opponent’s pawn that has just moved two squares forward from its starting position and landed next to one of your pawns.",
    "Check is when a player’s king is threatened with capture by an opponent’s piece or pawn",
    "Checkmate is when a player’s king is threatened with capture (check) and there is no legal move that can be made to remove that threat. This ends the game and results in victory for the opposing player.",
    "No, a pawn cannot capture a piece that is directly in front of it. Pawns capture diagonally.",
    "No, a knight cannot move to a square of the same color it is currently on.",
    "No, a bishop cannot move to a square that is blocked by another piece. Bishops can only move to unoccupied squares along diagonals.",
    "No, a rook cannot move to a square that is blocked by another piece. Rooks can only move to unoccupied squares along ranks and files.",
    "No, a queen cannot move to a square that is blocked by another piece. Queens can only move to unoccupied squares along ranks, files, and diagonals.",
    "No, a king cannot move to a square that is attacked by an opponent’s piece. This would put the king in check, which is not allowed.",
    "No, you cannot castle with both rooks in one move. Castling can only be done with one rook at a time.",
    "No, you cannot castle if your king has already moved. Castling can only be done if neither the king nor the rook involved has moved yet.",
    "Yes, you can perform en passant with any pawn that meets the requirements: an opponent’s pawn moves two squares forward from its starting position and lands next to one of your pawns. Your pawn can then capture that pawn as if it had only moved one square forward.",
    "Yes, you can promote a pawn to any piece (queen, rook, bishop or knight) in chess when it reaches the opposite end of the board.",
    "No, you cannot promote a pawn to an opponent’s piece in chess. You can only promote a pawn to one of your own pieces (queen, rook, bishop or knight).",
    "If your king is in check and you have no legal moves to get out of check (i.e., you cannot capture the attacking piece(s), block their attack(s), or move your king out of check), then your king is in checkmate and you lose the game.",
    "If your king is not in check but you have no legal moves to make (i.e., all of your pieces are blocked or pinned), then the game ends in stalemate (a draw).",
    "Yes, you can put your opponent’s king in checkmate with any piece or combination of pieces in chess if they create an inescapable threat to capture your opponent’s king on their next turn.",
    "Yes, you can put your opponent’s king in stalemate with any piece or combination of pieces in chess if they block all legal moves for your opponent without putting their king in check.",
    "Yes, you can capture an opponent’s piece that is protected by another piece in chess if doing so does not put your own king in check.",
    "Yes, you can put your opponent’s king in check with any piece in chess if it attacks your opponent’s king.",
    "Yes, you can put your opponent’s king in checkmate with any combination of pieces in chess if they create an inescapable threat to capture your opponent’s king on their next turn. However, certain combinations may be more difficult or unlikely than others depending on the position of the pieces on the board. For example, it is possible but rare to checkmate with only two knights or only one bishop. It is also possible but difficult to checkmate with only one rook or queen against a lone king. Checkmating with two bishops or",
    "A chessboard is a checkered gameboard used for the game of chess, on which the chess pieces are placed. The chessboard is square in shape and has a grid of 8x8 squares, resulting in 64 squares of alternating colors. Each player starts with 16 pieces, which are placed on the two rows closest to the player. The chessboard is positioned so that the bottom-right square is white"
  ]
}